Repository: pivovar-samara/family-menu
Catalog: FamilyMenuPlanner/Resources/Localizable.xcstrings
Source language: en
Languages: ru

source: %d ingredient(s) missing product selection
ru: %d ингредиент(ов) без выбора продукта

source: %d of %d purchased
ru: %d из %d куплено

source: %d selected
ru: Выбрано: %d

source: A diagnostics file will be automatically attached to help us resolve issues faster.
ru: Диагностический файл будет автоматически прикреплен к сообщению, чтобы нам было проще найти проблему.

source: A-Z
ru: А-Я

source: Add a descriptive name for your dish
ru: Добавьте описательное название для вашего блюда

source: Add and organize your ingredients
ru: Добавьте и организуйте ваши ингредиенты

source: Add First Ingredient
ru: Добавить первый ингредиент

source: Add Ingredient
ru: Добавить ингредиент

source: Add New Dish
ru: Добавить

source: Add Product
ru: Добавить продукт

source: Add Selected
ru: Добавить выбранные

source: Add the ingredients needed for this dish
ru: Добавьте ингредиенты, необходимые для этого блюда

source: Add Your First Dish
ru: Добавить первое блюдо

source: Add Your First Product
ru: Добавить первый продукт

source: An unexpected error occurred: %@
ru: Произошла непредвиденная ошибка: %@

source: App Initialization Error
ru: Ошибка инициализации приложения

source: Appetizer
ru: Закуска

source: Are you sure you want to delete this dish?
ru: Вы уверены, что хотите удалить это блюдо?

source: Are you sure you want to delete this product?
ru: Вы уверены, что хотите удалить этот продукт?

source: At least one ingredient is required
ru: Требуется хотя бы один ингредиент

source: At least one meal type is required
ru: Требуется хотя бы один тип приёма пищи

source: Back
ru: Назад

source: Basic Information
ru: Основная информация

source: Breakfast
ru: Завтрак

source: By Unit Type
ru: По типу единиц

source: Cache Management
ru: Управление кешем

source: Cancel
ru: Отмена

source: Category
ru: Категория

source: Check Data Validity
ru: Проверить состояние данных

source: Choose a dish
ru: Выберите блюдо

source: Clear %@
ru: Очистить %@

source: Clear All Data
ru: Удалить все данные

source: Clear All Day
ru: Очистить весь день

source: Clear Dishes
ru: Удалить блюда

source: Close
ru: Закрыть

source: Complete product selection for all ingredients
ru: Завершите выбор продуктов для всех ингредиентов

source: Continue
ru: Продолжить

source: Create dishes first to select them for your menu
ru: Сначала создайте блюда, чтобы выбирать их для вашего меню

source: Create products first to select them for your dishes
ru: Сначала создайте продукты, чтобы выбирать их для ваших блюд

source: Current Version:
ru: Текущая версия:

source: Currently selected
ru: В настоящее время выбрано

source: Data Management
ru: Управление данными

source: Data Version Info
ru: Информация о БД

source: Database Operations
ru: Действия с БД

source: Database Status:
ru: Статус БД

source: Debug
ru: Дебаг

source: Decrease quantity
ru: Уменьшить количество

source: Default
ru: По умолчанию

source: Delete
ru: Удалить

source: Delete Dish
ru: Удалить блюдо

source: Delete Product
ru: Удалить продукт

source: Description
ru: Описание

source: Deselect All
ru: Снять выбор

source: Dessert
ru: Десерт

source: Dinner
ru: Ужин

source: Dish must have at least one ingredient.
ru: В блюде должен быть хотя бы один ингредиент.

source: Dish must have at least one meal type.
ru: Блюдо должно быть доступно хотя бы для одного типа приёма пищи.

source: Dish Name
ru: Название блюда

source: Dish name cannot be empty.
ru: Название блюда не может быть пустым.

source: Dish name is required
ru: Название блюда обязательно

source: Dish Summary
ru: Сводка блюда

source: Dishes
ru: Блюда

source: Dishes for %@
ru: Блюда на %@

source: Done
ru: Готово

source: Edit
ru: Редактировать

source: Edit dish
ru: Редактировать блюдо

source: Edit product
ru: Редактировать продукт

source: Edit Product
ru: Редактирование продукта

source: Editing current week
ru: Редактируется текущая неделя

source: Editing next week
ru: Редактируется следующая неделя

source: Editing week after next
ru: Редактируется неделя после следующей

source: Email Not Available
ru: Почта недоступна

source: Enter dish name
ru: Введите название блюда

source: Enter product name
ru: Введите название продукта

source: Enter subject
ru: Введите тему письма

source: Error
ru: Ошибка

source: Error clearing mealType. Please try again.
ru: Произошла ошибка при удалении блюда. Попробуйте ещё раз.

source: Error deleting product. Please try again.
ru: Произошла ошибка при удалении продукта. Попробуйте ещё раз.

source: Error replacing dish. Please try again.
ru: Произошла ошибка при замене блюда. Попробуйте ещё раз.

source: Failed to delete dishes. Please try again.
ru: Произошла ошибка при удалении блюд. Попробуйте ещё раз.

source: Failed to initialize app data. Please restart the app.
ru: Не удалось инициализировать данные приложения. Пожалуйста, перезапустите приложение.

source: Failed to load data store: %@
ru: Ошибка загрузки данных: %@

source: Failed to migrate data: %@
ru: Ошибка миграции данных: %@

source: Failed to recover data store: %@
ru: Ошибка восстановления данных: %@

source: Failed to save changes. Please try again.
ru: Невозможно сохранить изменения. Попробуйте ещё раз.

source: Force Schema Update
ru: Вызвать обновление схемы

source: Friday
ru: Пятница

source: g
ru: г

source: Garnish
ru: Гарнир

source: Generate
ru: Создать

source: Generate a menu first to see your shopping list
ru: Сначала создайте меню, чтобы увидеть список покупок

source: Generate a menu for this week to start planning your meals
ru: Создайте меню на эту неделю, чтобы начать планировать приемы пищи

source: Generate Menu
ru: Создать меню

source: Generate New Menu
ru: Создать новое меню

source: Have feedback? Write us
ru: Хотите оставить отзыв? Напишите нам

source: Increase quantity
ru: Увеличить количество

# ingredient_unusual_quantity_message
source: %@ quantity may be unusual (%@ %@). Typical range: %@–%@ %@
ru: %@ количество может быть необычным (%@ %@). Типичный диапазон: %@–%@ %@

# ingredient_unusual_quantity_suggestion
source: Double-check this ingredient amount
ru: Проверьте количество этого ингредиента

source: Ingredients
ru: Ингредиенты

source: Ingredients (%d)
ru: Ингредиенты (%d)

source: Ingredients List
ru: Список ингредиентов

source: Insufficient disk space to load the app
ru: Недостаточно места на диске для загрузки приложения

source: Invalidate Static Cache
ru: Сбросить кеш

# InvalidWeekSelectionMessage
source: Invalid week selection. Please try again.
ru: Некорректный выбор недели. Пожалуйста, попробуйте еще раз.

source: kg
ru: кг

source: l
ru: л

source: Large quantity
ru: Большое количество

source: Loading...
ru: Загрузка данных...

source: Lunch
ru: Обед

source: Main Course
ru: Основное блюдо

source: Meal Types
ru: Время приёма пищи

source: Menu
ru: Меню

source: Message
ru: Сообщение

source: ml
ru: мл

source: Monday
ru: Понедельник

source: Name
ru: Название

source: Name A-Z
ru: Название А-Я

source: Name Z-A
ru: Название Я-А

source: Need to make changes?
ru: Нужно внести изменения?

source: Next
ru: Далее

source: No Category
ru: Без категории

source: No Dishes Available
ru: Блюда недоступны

source: No dishes available to generate a menu.
ru: Нет блюд для создания меню.

source: No Dishes Yet
ru: Блюд пока нет

source: No ingredients added
ru: Ингредиенты не добавлены

source: No ingredients yet
ru: Пока нет ингредиентов

source: No meal types selected
ru: Время приёма пищи не выбрано

source: No Menu Planned
ru: Меню не планировалось

source: No personally identifiable data is included.
ru: Мы не собираем персональные данные.

source: No Products Available
ru: Продукты недоступны

source: No Products Yet
ru: Продуктов пока нет

source: No recipe details
ru: Рецепт отсутствует

source: No results found
ru: Ничего не найдено

source: No Shopping Items
ru: Нет товаров для покупок

source: no unit
ru: без единицы

source: OK
ru: ОК

source: Optional
ru: По желанию

source: Other Dishes
ru: Другие блюда

source: pcs
ru: шт.

source: per %@
ru: за %@

source: Permission denied to access data
ru: Отказано в доступе к данным

source: Please select a unit for the product.
ru: Выберите единицы измерения продукта.

source: Product Information
ru: Информация о продукте

source: Product Name
ru: Название продукта

source: Product name cannot be empty.
ru: Название продукта не может быть пустым.

source: Products
ru: Продукты

source: Quantity: High to Low
ru: Количество: по убыванию

source: Quantity: Low to High
ru: Количество: по возрастанию

source: Ready to save?
ru: Готовы к сохранению?

source: Recipe
ru: Рецепт

source: Regenerate Initial Data
ru: Генерировать начальный набор данных

source: Review
ru: Проверка

source: Review your dish details
ru: Проверьте детали блюда

source: Saturday
ru: Суббота

source: Sauce
ru: Соус

source: Save
ru: Сохранить

source: Search dishes...
ru: Поиск блюд...

source: Search items...
ru: Поиск товаров...

source: Search products...
ru: Поиск продуктов...

source: Select All
ru: Выбрать все

source: Select all meal types that apply
ru: Выберите все подходящие времена приёма пищи

source: Select Dish
ru: Выбрать блюдо

source: Select Product
ru: Выберите продукт

source: Select Products
ru: Выберите продукты

source: Select Week
ru: Выберите неделю

source: Select when this dish is typically served
ru: Выберите, когда обычно подаётся это блюдо

source: Selected
ru: Выбрано

source: Selection options
ru: Параметры выбора

source: Send
ru: Отправить

source: Send Feedback
ru: Отправить отзыв

source: Setting up your data...
ru: Настройка ваших данных...

source: Shopping List
ru: Список покупок

source: Show Cache Status
ru: Посмотреть содержимое кеша

source: Sort
ru: Сортировать

source: Sort dishes
ru: Сортировать блюда

source: Sort products
ru: Сортировать продукты

source: Sort shopping list
ru: Сортировать список покупок

source: Soup
ru: Суп

source: Start building your pantry by adding your first product
ru: Начните заполнять вашу кладовую, добавив первый продукт

source: Start building your recipe collection by adding your first dish
ru: Начните создавать коллекцию рецептов, добавив первое блюдо

source: Start by adding your first ingredient
ru: Начните с добавления первого ингредиента

source: Step %d of %d
ru: Шаг %d из %d

source: Stored Version:
ru: Сохранённая версия

source: Subject
ru: Тема

source: Sunday
ru: Воскресенье

source: Syncing with iCloud…
ru: Синхронизация с iCloud…

source: Tap to edit • Long press for options
ru: Нажмите для редактирования • Удерживайте для опций

source: Tap to edit quantity
ru: Нажмите, чтобы изменить количество

source: Tap to edit this product
ru: Нажмите, чтобы редактировать этот продукт

source: Tap to select this dish
ru: Нажмите, чтобы выбрать это блюдо

source: Tap to select this item
ru: Нажмите, чтобы выбрать этот товар

source: Tap to select this meal type
ru: Нажмите, чтобы выбрать это время

source: Tap to select this product
ru: Нажмите, чтобы выбрать этот продукт

source: tbsp
ru: ст. л.

source: This device isn't set up to send email. Please contact %@ manually.
ru: На этом устройстве не настроена почта. Пожалуйста, свяжитесь с нами по %@.

source: This will overwrite the current menu. Are you sure?
ru: Это перезапишет текущее меню. Вы уверены?

source: Thursday
ru: Четверг

source: Today
ru: Сегодня

source: Today is %@
ru: Сегодня %@

source: Try Again
ru: Попробовать снова

source: tsp
ru: ч. л.

source: Tuesday
ru: Вторник

source: Unable to recover from the error. Please restart the app or contact support if the problem persists.
ru: Не удалось восстановить работу. Перезапустите приложение или обратитесь в поддержку, если проблема сохраняется.

source: Unit
ru: Единица измерения

source: Unit of Measurement
ru: Единица измерения

source: Unknown Product
ru: Неизвестный продукт

source: Unnamed Dish
ru: Безымянное блюдо

source: Unnamed Product
ru: Безымянный продукт

source: Use the Back button or swipe to return to previous steps and make any necessary changes.
ru: Используйте кнопку Назад или смахивание, чтобы вернуться к предыдущим шагам и внести необходимые изменения.

source: Validation
ru: Проверка

source: Warning
ru: Предупреждение

source: We’d love to hear from you.
ru: Нам важно ваше мнение.

source: Wednesday
ru: Среда

source: What ingredients do you need?
ru: Какие ингредиенты вам нужны?

source: When is this dish served?
ru: Когда подаётся это блюдо?

source: You are editing a past date.
ru: Вы редактируете прошедшую дату.

source: Z-A
ru: Я-А
